unit_conversion = {
    'ounce': 28.35,  # 1 унция = 28.35 грамма
    'ounces': 28.35,
    'pound': 453.6,  # 1 фунт = 453.6 грамма
    'pounds': 453.6,
    'cup': 240,  # 1 чашка = 240 мл
    'cups': 240,
    'tablespoon': 15,  # 1 столовая ложка = 15 мл
    'tablespoons': 15,
    'teaspoon': 5,  # 1 чайная ложка = 5 мл
    'teaspoons': 5,
    'quart': 946,  # 1 кварт = 946 мл
    'quarts': 946,
    'liter': 1000,  # 1 литр = 1000 мл
    'liters': 1000,
    'milliliter': 1,  # 1 миллилитр
    'milliliters': 1,
    'gram': 1,  # 1 грамм
    'grams': 1,
    'pinch': 0.36,  # Около 0.36 грамма (щепотка)
    'pinches': 0.36,
    'clove': 5,  # Около 5 граммов (долька для чеснока)
    'cloves': 5,
    'slice': 15,  # Примерно 15 граммов на слайс (например, бекона)
    'slices': 15,
    'piece': 20,  # Примерно 20 граммов на кусок (может варьироваться)
    'pieces': 20,
    'can': 400,  # Примерное содержание консервной банки, 400 мл
    'cans': 400,
    'dash': 0.6,  # Примерно 0.6 мл (для специй)
    'dashes': 0.6,
    'quart': 946,  # 1 кварт = 946 мл
    'quarts': 946,
    'fluid ounce': 29.57,  # 1 жидкая унция = 29.57 мл
    'fluid ounces': 29.57,
    'head': 400,  # Примерный вес одной головки капусты (в граммах)
    'heads': 400,
    'sheet': 5,  # Примерный вес одного листа водорослей или теста
    'sheets': 5,
    'wrapper': 10,  # Примерно 10 граммов на один лист
    'wrappers': 10,
    'egg': 50,  # Один яйцо, примерно 50 граммов
    'eggs': 50,
    'stick': 113,  # Около 113 граммов (одна палочка масла)
    'sticks': 113,
    'package': 200,  # Примерный вес одной упаковки (в граммах)
    'packages': 200,
    'bunch': 100,  # Примерный вес пучка зелени (в граммах)
    'bunches': 100,
    'leaf': 5,  # Вес одного листа (зелени или капусты)
    'leaves': 5,
    'sprig': 2,  # Примерный вес одного побега зелени
    'sprigs': 2
}

fraction_conversion = {
    '½': 0.5,
    '⅓': 1/3,
    '¼': 0.25,
    '¾': 0.75,
    '⅔': 2/3,
    '⅛': 1/8,
}
